<template>
  <div ref="root" class="app">
    <p>
      В условиях очагового земледелия ортзанд концентрирует мозаичный фраджипэн одинаково по всем направлениям. Альбедо иссушает минерал. Водопотребление пространственно растворяет ореховатый влагомер в полном соответствии с законом Дарси. Как мы уже знаем, гумус отталкивает водонасыщенный прибор Качинского как при нагреве, так и при охлаждении. Чернозём, как следствие уникальности почвообразования в данных условиях, статистически перемещает мозаичный горизонт.
    </p>
    <p>
      В условиях очагового земледелия ортзанд концентрирует мозаичный фраджипэн одинаково по всем направлениям. Альбедо иссушает минерал. Водопотребление пространственно растворяет ореховатый влагомер в полном соответствии с законом Дарси. Как мы уже знаем, гумус отталкивает водонасыщенный прибор Качинского как при нагреве, так и при охлаждении. Чернозём, как следствие уникальности почвообразования в данных условиях, статистически перемещает мозаичный горизонт.
    </p>
    <p>
      В условиях очагового земледелия ортзанд концентрирует мозаичный фраджипэн одинаково по всем направлениям. Альбедо иссушает минерал. Водопотребление пространственно растворяет ореховатый влагомер в полном соответствии с законом Дарси. Как мы уже знаем, гумус отталкивает водонасыщенный прибор Качинского как при нагреве, так и при охлаждении. Чернозём, как следствие уникальности почвообразования в данных условиях, статистически перемещает мозаичный горизонт.
    </p>

    <button @click="show" >Click</button>

    <div v-if="hidden">
      <p>
        В условиях очагового земледелия ортзанд концентрирует мозаичный фраджипэн одинаково по всем направлениям. Альбедо иссушает минерал. Водопотребление пространственно растворяет ореховатый влагомер в полном соответствии с законом Дарси. Как мы уже знаем, гумус отталкивает водонасыщенный прибор Качинского как при нагреве, так и при охлаждении. Чернозём, как следствие уникальности почвообразования в данных условиях, статистически перемещает мозаичный горизонт.
     </p>
    </div>


       <img src="https://placehold.it/600x1000" />
    <p>
      В условиях очагового земледелия ортзанд концентрирует мозаичный фраджипэн одинаково по всем направлениям. Альбедо иссушает минерал. Водопотребление пространственно растворяет ореховатый влагомер в полном соответствии с законом Дарси. Как мы уже знаем, гумус отталкивает водонасыщенный прибор Качинского как при нагреве, так и при охлаждении. Чернозём, как следствие уникальности почвообразования в данных условиях, статистически перемещает мозаичный горизонт.
    </p>

    <p>
      В условиях очагового земледелия ортзанд концентрирует мозаичный фраджипэн одинаково по всем направлениям. Альбедо иссушает минерал. Водопотребление пространственно растворяет ореховатый влагомер в полном соответствии с законом Дарси. Как мы уже знаем, гумус отталкивает водонасыщенный прибор Качинского как при нагреве, так и при охлаждении. Чернозём, как следствие уникальности почвообразования в данных условиях, статистически перемещает мозаичный горизонт.
    </p>
    <p>
      В условиях очагового земледелия ортзанд концентрирует мозаичный фраджипэн одинаково по всем направлениям. Альбедо иссушает минерал. Водопотребление пространственно растворяет ореховатый влагомер в полном соответствии с законом Дарси. Как мы уже знаем, гумус отталкивает водонасыщенный прибор Качинского как при нагреве, так и при охлаждении. Чернозём, как следствие уникальности почвообразования в данных условиях, статистически перемещает мозаичный горизонт.
    </p>
    <p>
      В условиях очагового земледелия ортзанд концентрирует мозаичный фраджипэн одинаково по всем направлениям. Альбедо иссушает минерал. Водопотребление пространственно растворяет ореховатый влагомер в полном соответствии с законом Дарси. Как мы уже знаем, гумус отталкивает водонасыщенный прибор Качинского как при нагреве, так и при охлаждении. Чернозём, как следствие уникальности почвообразования в данных условиях, статистически перемещает мозаичный горизонт.
    </p>
    <p>
      В условиях очагового земледелия ортзанд концентрирует мозаичный фраджипэн одинаково по всем направлениям. Альбедо иссушает минерал. Водопотребление пространственно растворяет ореховатый влагомер в полном соответствии с законом Дарси. Как мы уже знаем, гумус отталкивает водонасыщенный прибор Качинского как при нагреве, так и при охлаждении. Чернозём, как следствие уникальности почвообразования в данных условиях, статистически перемещает мозаичный горизонт.
    </p>
    <p>
      В условиях очагового земледелия ортзанд концентрирует мозаичный фраджипэн одинаково по всем направлениям. Альбедо иссушает минерал. Водопотребление пространственно растворяет ореховатый влагомер в полном соответствии с законом Дарси. Как мы уже знаем, гумус отталкивает водонасыщенный прибор Качинского как при нагреве, так и при охлаждении. Чернозём, как следствие уникальности почвообразования в данных условиях, статистически перемещает мозаичный горизонт.
    </p>
    <p>
      В условиях очагового земледелия ортзанд концентрирует мозаичный фраджипэн одинаково по всем направлениям. Альбедо иссушает минерал. Водопотребление пространственно растворяет ореховатый влагомер в полном соответствии с законом Дарси. Как мы уже знаем, гумус отталкивает водонасыщенный прибор Качинского как при нагреве, так и при охлаждении. Чернозём, как следствие уникальности почвообразования в данных условиях, статистически перемещает мозаичный горизонт.
    </p>
    <p>
      В условиях очагового земледелия ортзанд концентрирует мозаичный фраджипэн одинаково по всем направлениям. Альбедо иссушает минерал. Водопотребление пространственно растворяет ореховатый влагомер в полном соответствии с законом Дарси. Как мы уже знаем, гумус отталкивает водонасыщенный прибор Качинского как при нагреве, так и при охлаждении. Чернозём, как следствие уникальности почвообразования в данных условиях, статистически перемещает мозаичный горизонт.
    </p>
    <div class="sip_analytics" name="header" />
    <p>
      В условиях очагового земледелия ортзанд концентрирует мозаичный фраджипэн одинаково по всем направлениям. Альбедо иссушает минерал. Водопотребление пространственно растворяет ореховатый влагомер в полном соответствии с законом Дарси. Как мы уже знаем, гумус отталкивает водонасыщенный прибор Качинского как при нагреве, так и при охлаждении. Чернозём, как следствие уникальности почвообразования в данных условиях, статистически перемещает мозаичный горизонт.
    </p>
    <p>
      В условиях очагового земледелия ортзанд концентрирует мозаичный фраджипэн одинаково по всем направлениям. Альбедо иссушает минерал. Водопотребление пространственно растворяет ореховатый влагомер в полном соответствии с законом Дарси. Как мы уже знаем, гумус отталкивает водонасыщенный прибор Качинского как при нагреве, так и при охлаждении. Чернозём, как следствие уникальности почвообразования в данных условиях, статистически перемещает мозаичный горизонт.
    </p>
    <img src="https://placehold.it/1000x1000" />
    <p>
      В условиях очагового земледелия ортзанд концентрирует мозаичный фраджипэн одинаково по всем направлениям. Альбедо иссушает минерал. Водопотребление пространственно растворяет ореховатый влагомер в полном соответствии с законом Дарси. Как мы уже знаем, гумус отталкивает водонасыщенный прибор Качинского как при нагреве, так и при охлаждении. Чернозём, как следствие уникальности почвообразования в данных условиях, статистически перемещает мозаичный горизонт.
    </p>
    <div class="sip_analytics" />
    <p>
      В условиях очагового земледелия ортзанд концентрирует мозаичный фраджипэн одинаково по всем направлениям. Альбедо иссушает минерал. Водопотребление пространственно растворяет ореховатый влагомер в полном соответствии с законом Дарси. Как мы уже знаем, гумус отталкивает водонасыщенный прибор Качинского как при нагреве, так и при охлаждении. Чернозём, как следствие уникальности почвообразования в данных условиях, статистически перемещает мозаичный горизонт.
    </p>
    <p>
      В условиях очагового земледелия ортзанд концентрирует мозаичный фраджипэн одинаково по всем направлениям. Альбедо иссушает минерал. Водопотребление пространственно растворяет ореховатый влагомер в полном соответствии с законом Дарси. Как мы уже знаем, гумус отталкивает водонасыщенный прибор Качинского как при нагреве, так и при охлаждении. Чернозём, как следствие уникальности почвообразования в данных условиях, статистически перемещает мозаичный горизонт.
    </p>
    <p>
      В условиях очагового земледелия ортзанд концентрирует мозаичный фраджипэн одинаково по всем направлениям. Альбедо иссушает минерал. Водопотребление пространственно растворяет ореховатый влагомер в полном соответствии с законом Дарси. Как мы уже знаем, гумус отталкивает водонасыщенный прибор Качинского как при нагреве, так и при охлаждении. Чернозём, как следствие уникальности почвообразования в данных условиях, статистически перемещает мозаичный горизонт.
    </p>
    <p>
      В условиях очагового земледелия ортзанд концентрирует мозаичный фраджипэн одинаково по всем направлениям. Альбедо иссушает минерал. Водопотребление пространственно растворяет ореховатый влагомер в полном соответствии с законом Дарси. Как мы уже знаем, гумус отталкивает водонасыщенный прибор Качинского как при нагреве, так и при охлаждении. Чернозём, как следствие уникальности почвообразования в данных условиях, статистически перемещает мозаичный горизонт.
    </p>

  </div>
</template>

<script>
require('waypoints/lib/noframework.waypoints.min.js')

export default {
  name: 'App',
  data () {
    return {
      hidden: false,
      analytics: null
    }
  },
  mounted() {
    this.analytics = new this.$analytics({
      projectName: 'my_project',
      root: this.$refs.root,
      selector: '.sip_analytics',
      waypoint: Waypoint,
      debug: true,
    })
    this.analytics.init()
  },
  methods: {
    show() {
      this.hidden = !this.hidden
      this.analytics.event('inner_link', 'slide1')
    }
  }
}
</script>
<style lang="stylus">
@import '../node_modules/normalize.css/normalize.css'

*
  box-sizing border-box

.app
  max-width 600px
  width 100%
  margin 100px auto

</style>